package javabasic;

/*
 * 주석: 프로그램 실행과는 상관없이 코드에 설명을 붙인 것, 복잡한 코드일수록 주석을 달면 
 *      전체 코드를 이해하기 쉽고 수정이 용이
 *      다른 사람이 작성한 코드를 주석없이 해석하는 작업은 쉬운 일이 아니기에
 *      본인이 작성한 코드를 다른 사람이 볼 필요가 있다면 주석을 꼭 사용
 *      주석은 컴파일 과정에서 무시되기 때문에 주석을 많이 작성한다해서 파일의 크기에 영향X
 *      따라서 설명이 필요한 코드엔 주석을 달아두는 것이 좋다
 *      
 * 주석기호 
 * 라인주석(한줄 주석):  / //... / // 부터 라인 끝까지 내용 주석처리
 * 범위 주석(여러줄 주석): /* */  // 기호 사이에 있는 내용은 모두 주석 처리
 // */
 
 /*
  * 작성자: 김자바
  * 작성일: 2024-09-24
  */

public class C01_03_01 {
	public static void main(String[] args) {
		System.out.println("Hello Java 02");
	}
}
